<?php

use Illuminate\Database\Seeder;

class ClubsTableSeeder extends Seeder
{
    public function run()
    {
        DB::table('clubs')->insert([
            [
                'name' => 'ชมรมดนตรีสากล',
            ],
            [
                'name' => 'ชมรมพุทธศาสตร์',
            ],
            [
                'name' => 'ชมรมฟุตซอล',
            ],
            [
                'name' => 'ชมรมอาสาพัฒนาชนบท',
            ],
            [
                'name' => 'ชมรมหุ่นยนต์',
            ],
            [
                'name' => 'ชมรมฟอร์มูล่า',
            ],
            [
                'name' => 'สโมสรนักศึกษาคณะวิศวกรรมศาสตร์',
            ],
            [
                'name' => 'สโมสรนักศึกษาคณะวิทยาศาสตร์',
            ],
            [
                'name' => 'สโมสรนักศึกษาคณะเทคโนโลยีสารสนเทศ',
            ],
            [
                'name' => 'สโมสรนักศึกษาคณะครุศาสตร์อุตสาหกรรมและเทคโนโลยี',
            ],
            [
                'name' => 'สโมสรนักศึกษาคณะสถาปัตยกรรมศาสตร์และการออกแบบ',
            ],
            [
                'name' => 'สโมสรนักศึกษาสถาบันวิทยาการหุ่นยนต์ภาคสนาม',
            ],
        ]);
    }
}
